package com.company;

public class Main {
    public static int mainSum = 0;

    public static void main(String[] args) {
        //завести массив на ~1 000 000 элементов,
        //заполнить рандомно
        //завести n штук CounterThread'ов,
        //выделив каждому кусок массива,
        //сумму которого он считает
        //запустить каждый, дождаться окончания
        //работы всех тредов => получили сумму в
        //переменной mainSum
        //Для проверки прямо в main'e посчитайте
        //сумму обычным for'ом по всему массиву
        //сравните полученные результаты
    }
}
